src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1Прежний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйКанал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемПриходится</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	//ставку педагога назначает руководитель (R24): менеджеру — отказ и в обход формы
	УЗ_ЗарплатаУрока.ПроверитьСтавкуСправочника(ЭтотОбъект, Отказ);

	//новый педагог без папки — в группу «Педагоги» (не в корень справочника)
	Если ЭтоНовый() И ЭтоПедагог И Не ЗначениеЗаполнено(Родитель) Тогда
		Родитель = Справочники.УЗ_ФизЛица.Педагоги;
	КонецЕсли;
	//возраст не хранится, если известна дата рождения: его вычисляют от даты рождения (списки, карточка, дни
	//рождения — УЗ_ОбщийКлиентСервер.ВозрастНаДату). Хранимый «Возраст» — только когда даты рождения нет
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		Возраст = 0;
	КонецЕсли;
	//В45: согласие на сообщения — с датой (152-ФЗ, ст. 44.1 ФЗ «О связи»: когда дано и когда отозвано);
	//отметили — дата согласия, сняли (в карточке или командой /stop боту) — дата отписки
	СогласиеБыло = ?(ЭтоНовый(), Ложь, Ссылка.ОповеститьПоEmail = Истина);
	Если ОповеститьПоEmail И Не СогласиеБыло Тогда
		ДатаСогласия = ТекущаяДатаСеанса();
	ИначеЕсли Не ОповеститьПоEmail И СогласиеБыло Тогда
		ДатаОтписки = ТекущаяДатаСеанса();
	КонецЕсли;
	ПроверитьПользователяПрограммы(Отказ);
	//В33: плательщики ученика — у строки плательщик, без повторов, основной один
	Справочники.УЗ_ФизЛица.ПроверитьПлательщиков(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//новое фото, выбранное в карточке (ДополнительныеСвойства.УЗ_НовоеФото — ДвоичныеДанные), применяется только при
	//записи карточки и в её транзакции: не записали карточку — фото в базе прежнее. Картинка — в текущее фото
	//(новая запись «Фото» — только если фото не было), Справочники.УЗ_Фото.ФотоСКартинкой — как у предмета
	НовоеФото = Неопределено;
	Если ДополнительныеСвойства.Свойство("УЗ_НовоеФото", НовоеФото) И ТипЗнч(НовоеФото) = Тип("ДвоичныеДанные") Тогда
		Фото = Справочники.УЗ_Фото.ФотоСКартинкой(Фото, Наименование, НовоеФото);
		ДополнительныеСвойства.Удалить("УЗ_НовоеФото");
	КонецЕсли;

КонецПроцедуры

//ИНН и документ физ. лица из карточки (В41) — в регистр УЗ_ДокументыФизЛиц в транзакции записи карточки: не записали
//карточку — и документ прежний. Форма кладёт их в ДополнительныеСвойства.УЗ_ДокументФизЛица (уже проверенными).
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ДанныеДокумента = Неопределено;
	Если ДополнительныеСвойства.Свойство("УЗ_ДокументФизЛица", ДанныеДокумента) Тогда
		РегистрыСведений.УЗ_ДокументыФизЛиц.ЗаписатьДанныеФизЛица(Ссылка, ДанныеДокумента);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Тариф = Неопределено;
	Скидка = Неопределено;
	Наименование = Неопределено;
	ЭтоПедагог = Неопределено;
	СтавкаПедагога = Неопределено;
	Родитель = Неопределено;
	//плательщики (В33) копируются: брат или сестра обычно с теми же родителями
	Возраст = Неопределено;
	ДатаРождения = Неопределено;
	Пол = Неопределено;
	Цвет = Неопределено;
	Фото = Неопределено;
	//учётная запись — у человека своя: копия карточки педагога без связи с пользователем (Codex 3, находка 4 —
	//прежде копия Сергея под именем Андрея входила в «Мои уроки» Сергея)
	Пользователь = Неопределено;

КонецПроцедуры

//«Пользователь программы» — вход педагога в «Мои уроки» (роль педагога видит уроки и зарплату по этой связи). Codex 3,
//находка 4: связь меняет только тот, у кого есть право на это поле (руководитель; у менеджера поле только для
//просмотра — запрет действует и в обход формы, программной записью), и один пользователь связан не больше чем
//с одним действующим (не помеченным на удаление) педагогом.
Процедура ПроверитьПользователяПрограммы(Отказ)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФизЛица.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Пользователь = &Пользователь
	|	И ФизЛица.Ссылка <> &Ссылка
	|	И ФизЛица.ЭтоПедагог
	|	И НЕ ФизЛица.ПометкаУдаления
	|	И НЕ ФизЛица.ЭтоГруппа");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Пакет = Запрос.ВыполнитьПакет();
	Прежний = Пакет[0].Выбрать();
	Изменен = ?(Прежний.Следующий(), Прежний.Пользователь <> Пользователь, ЗначениеЗаполнено(Пользователь));
	Если Изменен И Не ПравоДоступа("Редактирование", Метаданные().Реквизиты.Пользователь) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Пользователя программы у педагога указывает руководитель — у вас это поле только для "
				+ "просмотра'"),
			"Объект.Пользователь", , Отказ);
		Возврат;
	КонецЕсли;
	Если Не ЭтоПедагог Или ПометкаУдаления Или Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	Занят = Пакет[1].Выбрать();
	Если Занят.Следующий() Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр(
				"ru = 'Пользователь программы %1 уже связан с педагогом %2: у педагога своя учётная запись'"),
			Пользователь, Занят.Ссылка), "Объект.Пользователь", , Отказ);
	КонецЕсли;

КонецПроцедуры
